wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_fac.c
        /* load the x1 buffer for cofficientB */
        fac_fixed_data_preload(init_struct->coeffb_size, (init_struct->coeffb_ctx));

        /* load the x1 buffer for cofficientA */
        if((NULL != init_struct->coeffa_ctx) && (0U != init_struct->coeffa_size)) {
            /* Load the buffer into the internal memory */
            fac_fixed_data_preload(init_struct->coeffa_size, (init_struct->coeffa_ctx));
        }
        /* if need configure to preload output buffer */
        if((NULL != init_struct->output_ctx) && (0U != init_struct->output_size)) {
            FAC_PARACFG = ((uint32_t)init_struct->output_size & FAC_PARACFG_IPP) |  \
                          FUNC_LOAD_Y | FAC_PARACFG_EXE;

            /* load the Y buffer for input data */
            fac_fixed_data_preload(init_struct->output_size, init_struct->output_ctx);
        }
    }
}

/*!
    \brief      FAC preload X0 X1 Y float buffer  (API_ID(0x0007U))
    \param[in]  init_struct: FAC preload init struct
                  coeffa_size: size of the coefficient vector A,0~255
                  coeffa_ctx: [IIR only] content of the coefficient vector A
                  coeffb_size: size of the coefficient vector B
                  coeffb_ctx: size of the coefficient vector B
                  input_size: size of the input data,0~255
                  input_ctx: content of the input data
                  output_size: size of the output data,0~255
                  output_ctx: content of the output data
                only one parameter can be selected which is shown as below:
      \arg      PRELOAD_DMA_MODE: preload access buffer mode with dma
      \arg      PRELOAD_POLLING_MODE: preload access buffer mode with polling
    \param[out] none
    \retval     none
*/
void fac_float_buffer_preload(fac_float_data_preload_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(FAC_MODULE_ID, API_ID(0x0007U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* FAC_PARACFG: Config parameter of filter preload */
        FAC_PARACFG = ((uint32_t)init_struct->input_size & FAC_PARACFG_IPP) | \
                      FUNC_LOAD_X0 | FAC_PARACFG_EXE;

        /* load the x0 buffer for input data */
        fac_float_data_preload(init_struct->input_size, init_struct->input_ctx);
        /* configure dma for x0 preload */
        /* FAC_PARACFG: Config parameter of filter preload */
        FAC_PARACFG = (((uint32_t)init_struct->coeffb_size) & FAC_PARACFG_IPP) | \
                      ((((uint32_t)init_struct->coeffa_size) << 8) & FAC_PARACFG_IPQ) | \
                      FUNC_LOAD_X1 | FAC_PARACFG_EXE;

        /* load the x1 buffer for cofficientB */
        fac_float_data_preload(init_struct->coeffb_size, (init_struct->coeffb_ctx));

        /* load the x1 buffer for cofficientA */
        if((NULL != init_struct->coeffa_ctx) && (0U != init_struct->coeffa_size)) {
            /* load the buffer into the internal memory */
            fac_float_data_preload(init_struct->coeffa_size, (init_struct->coeffa_ctx));
        }
        /* if need configure to preload output buffer */
        if((NULL != init_struct->output_ctx) && (0U != init_struct->output_size)) {
            FAC_PARACFG = ((uint32_t)init_struct->output_size & FAC_PARACFG_IPP) | \
                          FUNC_LOAD_Y | FAC_PARACFG_EXE;

            /* load the Y buffer for input data */
            fac_float_data_preload(init_struct->output_size, init_struct->output_ctx);
        }
    }
}
/*!
    \brief      FAC preload fixed data pointer  (API_ID(0x0008U))
    \param[in]  array: 16-bit data
    \param[in]  size: size of data
    \param[out] none
    \retval     none
*/
void fac_fixed_data_preload(uint8_t size, int16_t array[])
{
    uint8_t i;
    for(i = 0U; i < size; i++) {
        FAC_WDATA = ((*((uint16_t *)&array[i])) & FAC_WDATA_WDATA);
    }
}

/*!
    \brief      FAC preload float data pointer  (API_ID(0x0009U))
    \param[in]  data: 32-bit data
    \param[in]  size: size of data
    \param[out] none
    \retval     none
*/
void fac_float_data_preload(uint8_t size, float array[])
{
    uint8_t i;
    for(i = 0U; i < size; i++) {
        FAC_WDATA = ((*((uint32_t *) & array[i])));
    }
}

/*!
    \brief      FAC reset write and read pointers. the internal control logic,FAC_STAT register and the FAC_PARACFG register is reset  (API_ID(0x000AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fac_reset(void)
{
    FAC_CTL |= FAC_CTL_RST;
}

/*!
    \brief      configure the FAC clip feature  (API_ID(0x000BU))
    \param[in]  cpmod: the state of clip
                only one parameter can be selected which is shown as below:
      \arg        FAC_CP_ENABLE: ENABLE CLIP
      \arg        FAC_CP_DISABLE: DISABLE CLIP
    \param[out] none
    \retval     none
*/
void fac_clip_config(uint8_t cpmod)
{
    if(FAC_CP_ENABLE == cpmod) {
        FAC_CTL |= FAC_CTL_CPEN;
    } else {
        FAC_CTL &= ~(FAC_CTL_CPEN);
    }
}

/*!
    \brief      enable FAC float point format  (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fac_float_enable(void)
{
    FAC_CTL |= FAC_CTL_FLTEN;
}

/*!
    \brief      disable FAC float point format  (API_ID(0x000DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fac_float_disable(void)
{
    FAC_CTL &= ~FAC_CTL_FLTEN;
}

/*!
    \brief      enable the FAC DMA  (API_ID(0x000EU))
    \param[in]  dma_req: dma transfer type
                only one parameter can be selected which is shown as below:
      \arg        FAC_DMA_READ: read buffer dma
      \arg        FAC_DMA_WRITE: write buffer dma
    \param[out] none
    \retval     none
*/
void fac_dma_enable(uint32_t dma_req)
{
    FAC_CTL |= dma_req;
}

/*!
    \brief      disable the FAC DMA  (API_ID(0x000FU))
    \param[in]  dma_req: dma transfer type
                only one parameter can be selected which is shown as below:
      \arg        FAC_DMA_READ: read buffer dma
      \arg        FAC_DMA_WRITE: write buffer dma
    \param[out] none
    \retval     none
*/
void fac_dma_disable(uint32_t dma_req)
{
    FAC_CTL &= ~dma_req;
}

/*!
    \brief      FAC configure input buffer (API_ID(0x0010U))
    \param[in]  watermark: threshold of input buffer
                  FAC_THRESHOLD_1, FAC_THRESHOLD_2,
                  FAC_THRESHOLD_4, FAC_THRESHOLD_8
    \param[in]  baseaddr: base address of input buffer, 0..255
    \param[in]  bufsize: buffer size of input buffer, 0..255
    \param[out] none
    \retval     none
*/
void fac_x0_config(uint32_t watermark, uint8_t baseaddr, uint8_t bufsize)
{
    /* set base address */
    FAC_X0BCFG &= ~FAC_X0BCFG_X0B_ADDR;
    FAC_X0BCFG |= ((uint32_t)(baseaddr & FAC_X0BCFG_X0B_ADDR));

    /* set buffer size */
    FAC_X0BCFG &= ~FAC_X0BCFG_X0B_SIZE;
    FAC_X0BCFG |= ((((uint32_t)bufsize) << 8U) & FAC_X0BCFG_X0B_SIZE);

    /* set watermark */
    FAC_X0BCFG &= ~FAC_X0BCFG_X0_WBFF;
    FAC_X0BCFG |= (watermark & FAC_X0BCFG_X0_WBFF);
}

/*!
    \brief      FAC configure coefficient buffer (API_ID(0x0011U))
    \param[in]  baseaddr: base address of coefficient buffer, 0..255
    \param[in]  bufsize: buffer size of coefficient buffer, 0..255
    \param[out] none
    \retval     none
*/
void fac_x1_config(uint8_t baseaddr, uint8_t bufsize)
{
    /* set base address */
    FAC_X1BCFG &= ~FAC_X1BCFG_X1B_ADDR;
    FAC_X1BCFG |= (((uint32_t)baseaddr) & FAC_X1BCFG_X1B_ADDR);

    /* set buffer size */
    FAC_X1BCFG &= ~FAC_X1BCFG_X1B_SIZE;
    FAC_X1BCFG |= ((((uint32_t)bufsize) << 8U) & FAC_X1BCFG_X1B_SIZE);
}

/*!
    \brief      FAC configure output buffer (API_ID(0x0012U))
    \param[in]  watermark: threshold of output buffer
                  FAC_THRESHOLD_1, FAC_THRESHOLD_2,
                  FAC_THRESHOLD_4, FAC_THRESHOLD_8
    \param[in]  baseaddr: base address of output buffer, 0..255
    \param[in]  bufsize: buffer size of output buffer, 0..255
    \param[out] none
    \retval     none
*/
void fac_y_config(uint32_t watermark, uint8_t baseaddr, uint8_t bufsize)
{
    /* set base address */
    FAC_YBCFG &= ~FAC_YBCFG_YB_ADDR;
    FAC_YBCFG |= (((uint32_t)baseaddr) & FAC_YBCFG_YB_ADDR);

    /* set buffer size */
    FAC_YBCFG &= ~FAC_YBCFG_YB_SIZE;
    FAC_YBCFG |= ((((uint32_t)bufsize) << 8U) & FAC_YBCFG_YB_SIZE);

    /* set watermark */
    FAC_YBCFG &= ~FAC_YBCFG_Y_WBEF;
    FAC_YBCFG |= (watermark & FAC_YBCFG_Y_WBEF);
}

/*!
    \brief      FAC configure execute function (API_ID(0x0013U))
    \param[in]  func: select function to excute
                  FUNC_CONVO_FIR, FUNC_IIR_DIRECT_FORM_1
    \param[in]  ipp: parameter of forward coefficient, 2..64
    \param[in]  ipq: parameter of backward coefficient, 1..63
    \param[in]  ipr: parameter of gain, 0..7
    \param[out] none
    \retval     none
*/
void fac_function_config(fac_parameter_struct *fac_parameter)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(fac_parameter)) {
        fw_debug_report_err(FAC_MODULE_ID, API_ID(0x0013U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* set function */
        FAC_PARACFG &= ~FAC_PARACFG_FUN;
        FAC_PARACFG |= fac_parameter->func;

        /* set filter parameter */
        FAC_PARACFG &= ~(FAC_PARACFG_IPP | FAC_PARACFG_IPQ | FAC_PARACFG_IPR);
        FAC_PARACFG |= (((uint32_t)fac_parameter->ipp) & FAC_PARACFG_IPP) | ((((uint32_t)fac_parameter->ipq) << 8U) & FAC_PARACFG_IPQ) | ((((uint32_t)fac_parameter->ipr) << 16U) & FAC_PARACFG_IPR);
    }
}

/*!
    \brief      start the fac (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fac_start(void)
{
    /* set start */
    FAC_PARACFG |= FAC_PARACFG_EXE;
}

/*!
    \brief      stop the fac (API_ID(0x0015U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fac_stop(void)
{
    /* set start */
    FAC_PARACFG &= ~FAC_PARACFG_EXE;
}

/*!
    \brief      finish the filter calculate (API_ID(0x0016U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fac_finish_calculate(void)
{
    /* clear execute */
    FAC_PARACFG &= ~FAC_PARACFG_EXE;

